It has been nearly a year since submitting this issue; so I decided to test this again to see if just maybe it was fixed in more recent versions. Seems a `plan` works, but fails on `apply` with same `non-transport transport` error message.

```
$ vault --version
Vault v1.16.0-rc3 (6d31a8d27ac89b0383e9c82a869941ff60b20850), built 2024-03-11T16:34:23Z
```

```
$ terraform --version
Terraform v1.8.0-beta1
on linux_amd64
+ provider registry.terraform.io/hashicorp/vault v4.0.0
```

`plan` works:
```
$ terraform plan

Terraform used the selected providers to generate the following execution plan.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vault_mount.example will be created
  + resource "vault_mount" "example" {
      + accessor                     = (known after apply)
      + audit_non_hmac_request_keys  = (known after apply)
      + audit_non_hmac_response_keys = (known after apply)
      + default_lease_ttl_seconds    = (known after apply)
      + external_entropy_access      = false
      + id                           = (known after apply)
      + max_lease_ttl_seconds        = (known after apply)
      + path                         = "dummy"
      + seal_wrap                    = (known after apply)
      + type                         = "generic"
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

`apply` fails:
```
$ terraform apply

Terraform used the selected providers to generate the following execution plan.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # vault_mount.example will be created
  + resource "vault_mount" "example" {
      + accessor                     = (known after apply)
      + audit_non_hmac_request_keys  = (known after apply)
      + audit_non_hmac_response_keys = (known after apply)
      + default_lease_ttl_seconds    = (known after apply)
      + external_entropy_access      = false
      + id                           = (known after apply)
      + max_lease_ttl_seconds        = (known after apply)
      + path                         = "dummy"
      + seal_wrap                    = (known after apply)
      + type                         = "generic"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

vault_mount.example: Creating...
╷
│ Error: failed to configure Vault API: attempting to specify unix:// address with non-transport transport
│ 
│   with vault_mount.example,
│   on main.tf line 15, in resource "vault_mount" "example":
│   15: resource "vault_mount" "example" {
│ 
╵
```